OpenQBMM-OpenFOAM-v2306/validation/diluteVdfTransportFoam/riser/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    inlet
    {
        type    cyclic;
    }
    outlet
    {
        type    cyclic;
    }
    walls
    {
        type    zeroGradient;
    }
}

particles
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];
    abscissaDimension0  [0 1 0 0 0 0 0];

    default
    {
        node0
        {
            weight  uniform 0.015;
            abscissae (120e-6 0 0 0);
        }
        node1
        {
            weight  uniform 0.015;
            abscissae (185e-6 0 0 0);
        }
    }
}


// ************************************************************************* //
